<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"688f09c77e6d921af762cfb9cc873233ad9581ed24f7b1beeb7f03865ac551b3","plan_job_ref":"Job Terraform Plan #746 at https://github.com/cal-itp/data-infra/actions/runs/20466719941","plan_out_hash":"75f17d3f10d79483367a3fdc1f170fb7da515525007002ebcaa9a90ff0c0e5d3","plan_hash":"89bb4bc985004f0fad44a5308160b280f9a3640aa9b571493bfbc2d127e17ef3","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/iam/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_project_iam_member.tfer--projects-002F-cal-itp-data-infra-002F-roles-002F-AgencyPaymentsServiceReaderserviceAccount-003A-slo-transit-payments-user-0040-cal-itp-data-infra-002E-iam-002E-gserviceaccount-002E-com will be created
+   resource "google_project_iam_member" "tfer--projects-002F-cal-itp-data-infra-002F-roles-002F-AgencyPaymentsServiceReaderserviceAccount-003A-slo-transit-payments-user-0040-cal-itp-data-infra-002E-iam-002E-gserviceaccount-002E-com" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:slo-transit-payments-user@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra"
+       role    = "projects/cal-itp-data-infra/roles/AgencyPaymentsServiceReader"
    }

  # google_service_account.slo-transit-payments-user will be created
+   resource "google_service_account" "slo-transit-payments-user" {
+       account_id = "*************************"
+       disabled   = false
+       email      = "slo-transit-payments-user@cal-itp-data-infra.iam.gserviceaccount.com"
+       id         = (known after apply)
+       member     = "serviceAccount:slo-transit-payments-user@cal-itp-data-infra.iam.gserviceaccount.com"
+       name       = (known after apply)
+       project    = "cal-itp-data-infra"
+       unique_id  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #746](https://github.com/cal-itp/data-infra/actions/runs/20466719941)